Bob-the-Kuhn/Marlin/Marlin/src/HAL/HAL_LPC1768/SPI_manager_LPC1768.cpp
#ifdef TARGET_LPC1768

#include <lpc17xx_ssp.h>
#include <lpc17xx_pinsel.h>
#include <lpc17xx_gpio.h>
#include "lpc17xx_clkpwr.h"

#include "pinmapping.h"

#include "../../Marlin.h"
#include "arduino.h"

/**
 *   SPI MODE  CPOL   CPHA
 *      0        0     0     CPOL 0 - clock idles at low
 *      1        0     1     CPOL 1 - clock idles at high
 *      2        1     0     CPHA 0 - data changes on trailing edge (slave clocks in data on leading edge)
 *      3        1     1     CPHA 1 - data changes on leading edge (slave clocks in data on trailing edge)
 */

#define NUM_SPI_CHANNELS 20

extern "C" void SSP0_IRQHandler(void);
extern "C" void SSP1_IRQHandler(void);

namespace HAL {
namespace SPI {

/* spi_channel vs.  hardware_channels :
 *   0: SW SPI      0: SW SPI
 *   1:             1: clk(0_15), mosi(0_28), miso(0_17), SSP0
 *   2:             2: clk(0_7),  mosi(0_9),  miso(0_8),  SSP1
 */

/*
 * Defines the Hardware setup for an SPI channel
 * The pins and (if applicable) the Hardware Peripheral
 *
 */

struct HardwareChannel {
  LPC_SSP_TypeDef *peripheral;
  IRQn_Type IRQn;
  uint32_t clk_port;
  uint32_t clk_pin;
  uint32_t mosi_port;
  uint32_t mosi_pin;
  uint32_t miso_port;
  uint32_t miso_pin;
  SSP_DATA_SETUP_Type xfer_config;
  volatile FlagStatus xfer_complete;
  bool initialized;
  volatile bool in_use;
} hardware_channel[3] = {
    {LPC_SSP0, SSP0_IRQn, 0, 0,  0, 0,  0, 0,  { nullptr, 0, nullptr, 0, 0, SSP_STAT_DONE }, RESET, false, false},
    {LPC_SSP0, SSP0_IRQn, 0, 15, 0, 18, 0, 17, { nullptr, 0, nullptr, 0, 0, SSP_STAT_DONE }, RESET, false, false},
    {LPC_SSP1, SSP1_IRQn, 0, 7,  0, 9,  0, 8 , { nullptr, 0, nullptr, 0, 0, SSP_STAT_DONE }, RESET, false, false}
};


struct LogicalChannel {
  int8_t spi_channel;    // 0: SW spi, 1: LCD SD card , 2+ system dependent
  pin_t sck;
  pin_t mosi;
  pin_t miso;
  pin_t chip_select;          // -1 - not used
  bool chip_select_polarity;  // 0 - active low
  uint32_t frequency;
  uint32_t frequency_used;    // may need to convert SD card speeds to a real frequency
  uint8_t spi_mode;
  bool bit_order;             // 1 - MSB first
  uint8_t num_bits;
  bool busy;
  volatile uint32_t* mosi_set_reg;
  volatile uint32_t* mosi_clr_reg;
  uint32_t mosi_bit_mask;
  volatile uint32_t* clock_active_register;
  volatile uint32_t* clock_inactive_register;
  uint32_t sck_bit_mask;
  volatile uint32_t* miso_read_reg;
  uint32_t miso_bit_mask;
  uint8_t  delay_A;
  uint8_t  delay_B;
};

LogicalChannel logical_channel[NUM_SPI_CHANNELS];

//Internal functions

extern "C" void ssp_irq_handler(uint8_t hw_channel);
#define SPI_CHANNEL(channel)    logical_channel[channel].spi_channel
#define HW_CHANNEL(channel)     hardware_channel[SPI_CHANNEL(channel)]
#define LPC_PORT_OFFSET         (0x0020)
#define LPC_PIN(pin)            (1UL << pin)
#define LPC_GPIO(port)          ((volatile LPC_GPIO_TypeDef *)(LPC_GPIO0_BASE + LPC_PORT_OFFSET * port))

#define LPC1768_PIN_PORT(pin)   ((uint8_t)((pin >> 5) & 0b111))
#define LPC1768_PIN_PIN(pin)    ((uint8_t)(pin & 0b11111))
#define ACTIVE_HIGH             1

int8_t active_logical_channel = -1;
int8_t active_hardware_channel = -1;

millis_t SPI_warning_delay;

void chip_select_active(int8_t channel) {
  if(logical_channel[channel].chip_select >= 0) {
    if(logical_channel[channel].chip_select_polarity == ACTIVE_HIGH)
      GPIO_SetValue(LPC1768_PIN_PORT(logical_channel[channel].chip_select), (_BV(LPC1768_PIN_PIN(logical_channel[channel].chip_select))));
    else
      GPIO_ClearValue(LPC1768_PIN_PORT(logical_channel[channel].chip_select), (_BV(LPC1768_PIN_PIN(logical_channel[channel].chip_select))));
  }
}

void chip_select_inactive(int8_t channel) {
  if(logical_channel[channel].chip_select >= 0) {
    if(logical_channel[channel].chip_select_polarity == ACTIVE_HIGH)
      GPIO_ClearValue(LPC1768_PIN_PORT(logical_channel[channel].chip_select), (_BV(LPC1768_PIN_PIN(logical_channel[channel].chip_select))));
    else
      GPIO_SetValue(LPC1768_PIN_PORT(logical_channel[channel].chip_select), (_BV(LPC1768_PIN_PIN(logical_channel[channel].chip_select))));
  }
}


/*
 * SPI API Implementation
 */
bool initialise_pins(uint8_t channel) {

  PINSEL_CFG_Type pin_cfg;
  pin_cfg.OpenDrain = PINSEL_PINMODE_NORMAL;
  pin_cfg.Pinmode = PINSEL_PINMODE_PULLUP;

  if(!HW_CHANNEL(channel).initialized && logical_channel[channel].spi_channel) {  // only do this for uninitialized hardware SPIs
    pin_cfg.Funcnum = 2; //ssp (spi) function
    pin_cfg.Portnum = HW_CHANNEL(channel).clk_port;
    pin_cfg.Pinnum = HW_CHANNEL(channel).clk_pin;
    PINSEL_ConfigPin(&pin_cfg); //clk

    pin_cfg.Portnum = HW_CHANNEL(channel).miso_port;
    pin_cfg.Pinnum = HW_CHANNEL(channel).miso_pin;
    PINSEL_ConfigPin(&pin_cfg); //miso

    pin_cfg.Portnum = HW_CHANNEL(channel).mosi_port;
    pin_cfg.Pinnum = HW_CHANNEL(channel).mosi_pin;
    PINSEL_ConfigPin(&pin_cfg); //mosi

    HW_CHANNEL(channel).initialized = true;
  }

  if (logical_channel[channel].chip_select >= 0) { // only do this for the hardware SPIs
    pin_cfg.Portnum = LPC1768_PIN_PORT(logical_channel[channel].chip_select);
    pin_cfg.Pinnum = LPC1768_PIN_PIN(logical_channel[channel].chip_select);
    pin_cfg.Pinmode = logical_channel[channel].chip_select_polarity !=  ACTIVE_HIGH ? PINSEL_PINMODE_PULLUP : PINSEL_PINMODE_PULLDOWN;
    pin_cfg.Funcnum = 0; //gpio function
    PINSEL_ConfigPin(&pin_cfg); // chip select

    GPIO_SetDir(LPC1768_PIN_PORT(logical_channel[channel].chip_select), (_BV(LPC1768_PIN_PIN(logical_channel[channel].chip_select))), 1);
    GPIO_SetValue(LPC1768_PIN_PORT(logical_channel[channel].chip_select), (_BV(LPC1768_PIN_PIN(logical_channel[channel].chip_select))));
  }

  if (logical_channel[channel].spi_channel ==0) {  // setup software spi pins
    pin_cfg.OpenDrain = PINSEL_PINMODE_NORMAL;
    pin_cfg.Pinmode = PINSEL_PINMODE_PULLUP;
    pin_cfg.Funcnum = 0; //gpio function

    pin_cfg.Portnum = LPC1768_PIN_PORT(logical_channel[channel].sck);
    pin_cfg.Pinnum = LPC1768_PIN_PIN(logical_channel[channel].sck);
    PINSEL_ConfigPin(&pin_cfg);
    if (logical_channel[channel].spi_mode & 0x02)  // set SCK to inactive state
      GPIO_SetValue(LPC1768_PIN_PORT(logical_channel[channel].sck), (_BV(LPC1768_PIN_PIN(logical_channel[channel].sck))));
    else
      GPIO_ClearValue(LPC1768_PIN_PORT(logical_channel[channel].sck), (_BV(LPC1768_PIN_PIN(logical_channel[channel].sck))));
    GPIO_SetDir(LPC1768_PIN_PORT(logical_channel[channel].sck), (_BV(LPC1768_PIN_PIN(logical_channel[channel].sck))), 1);


