Bob-the-Kuhn/Marlin/Marlin/src/HAL/HAL_LPC1768/SPI_manager_LPC1768.cpp
    pin_cfg.Portnum = LPC1768_PIN_PORT(logical_channel[channel].mosi);
    pin_cfg.Pinnum = LPC1768_PIN_PIN(logical_channel[channel].mosi);
    PINSEL_ConfigPin(&pin_cfg);
    GPIO_ClearValue(LPC1768_PIN_PORT(logical_channel[channel].mosi), (_BV(LPC1768_PIN_PIN(logical_channel[channel].mosi))));
    GPIO_SetDir(LPC1768_PIN_PORT(logical_channel[channel].mosi), (_BV(LPC1768_PIN_PIN(logical_channel[channel].mosi))), 1);


    pin_cfg.Portnum = LPC1768_PIN_PORT(logical_channel[channel].miso);
    pin_cfg.Pinnum = LPC1768_PIN_PIN(logical_channel[channel].miso);
    PINSEL_ConfigPin(&pin_cfg);
    GPIO_SetDir(LPC1768_PIN_PORT(logical_channel[channel].miso), (_BV(LPC1768_PIN_PIN(logical_channel[channel].miso))), 0);
  }
  return true;
} // initialise_pins


void setup_hardware_channel(uint8_t channel) {
  if (logical_channel[channel].spi_channel) {   // hardware SPI
    SSP_Cmd(HW_CHANNEL(channel).peripheral, DISABLE);

    SSP_CFG_Type HW_SPI_init; // data structure to hold init values
    HW_SPI_init.Mode = channel;
    HW_SPI_init.ClockRate = logical_channel[channel].frequency_used;
    HW_SPI_init.Databit = logical_channel[channel].num_bits;
    HW_SPI_init.CPHA = (logical_channel[channel].spi_mode & 0x01) << 7;
    HW_SPI_init.CPOL = ((logical_channel[channel].spi_mode >> 1) & 0x01) << 6;
    HW_SPI_init.Mode = SSP_MASTER_MODE;
    HW_SPI_init.FrameFormat = SSP_FRAME_SPI;
    SSP_Init(LPC_SSP0, &HW_SPI_init);  // puts the values into the proper bits in the SSP0 registers
    HW_CHANNEL(channel).peripheral->CR0 &= ~0x0F;
    HW_CHANNEL(channel).peripheral->CR0 |= (logical_channel[channel].num_bits - 1) & 0x0F;
    SSP_Cmd(HW_CHANNEL(channel).peripheral, ENABLE);
  }
  else {

    if (logical_channel[channel].spi_mode & 0x02) {
      logical_channel[channel].clock_active_register = &LPC_GPIO(LPC1768_PIN_PORT(logical_channel[channel].sck))->FIOCLR;
      logical_channel[channel].clock_inactive_register = &LPC_GPIO(LPC1768_PIN_PORT(logical_channel[channel].sck))->FIOSET;
    }
    else {
      logical_channel[channel].clock_active_register = &LPC_GPIO(LPC1768_PIN_PORT(logical_channel[channel].sck))->FIOSET;
      logical_channel[channel].clock_inactive_register = &LPC_GPIO(LPC1768_PIN_PORT(logical_channel[channel].sck))->FIOCLR;
    }
  }
} //  setup_hardware_channel


void get_frequency_used(uint8_t channel) {



  // table to convert Marlin spiRates (0-5 plus default) into bit rates
  uint32_t Marlin_speed[7]; // CPSR is always 2
  Marlin_speed[0] = 8333333; //(SCR:  2)  desired: 8,000,000  actual: 8,333,333  +4.2%  SPI_FULL_SPEED
  Marlin_speed[1] = 4166667; //(SCR:  5)  desired: 4,000,000  actual: 4,166,667  +4.2%  SPI_HALF_SPEED
  Marlin_speed[2] = 2083333; //(SCR: 11)  desired: 2,000,000  actual: 2,083,333  +4.2%  SPI_QUARTER_SPEED
  Marlin_speed[3] = 1000000; //(SCR: 24)  desired: 1,000,000  actual: 1,000,000         SPI_EIGHTH_SPEED
  Marlin_speed[4] =  500000; //(SCR: 49)  desired:   500,000  actual:   500,000         SPI_SPEED_5
  Marlin_speed[5] =  250000; //(SCR: 99)  desired:   250,000  actual:   250,000         SPI_SPEED_6
  Marlin_speed[6] =  125000; //(SCR:199)  desired:   125,000  actual:   125,000         Default from HAL.h


  struct sw_SPI_speed {   // table to look up sw SPI delays to get desired frequency
    uint32_t frequency;
    uint8_t  delay_A;
    uint8_t  delay_B;
  } speed_sw_SPI[6] = {
                        {2000000,  1,  1},
                        {1000000,  5,  5},
                        { 750000, 11, 11},
                        { 500000, 19, 19},
                        { 250000, 44, 44},
                        { 125000, 95, 95}
  };


  if (logical_channel[channel].frequency < 7)
    logical_channel[channel].frequency_used = Marlin_speed[logical_channel[channel].frequency];
  else
    logical_channel[channel].frequency_used = logical_channel[channel].frequency;

  if (!logical_channel[channel].spi_channel) //
    for (uint8_t i = 0; i < COUNT(speed_sw_SPI); i++) {
      logical_channel[channel].delay_A = speed_sw_SPI[i].delay_A;
      logical_channel[channel].delay_B = speed_sw_SPI[i].delay_B;
      if (logical_channel[channel].frequency_used >= speed_sw_SPI[i].frequency) break;
    }
}

int8_t num_logical_channels = -1;
bool out_of_channels = false;
bool first_time_warning = true;

int8_t create_logical_spi_channel(int8_t spi_channel, pin_t cs_pin, bool cs_polarity, uint32_t frequency, uint8_t spi_mode) {
  num_logical_channels++;
  if (num_logical_channels == NUM_SPI_CHANNELS) {  // warn if out of channels
    SPI_warning_delay = millis() + 10000;
    out_of_channels = true;
    return -1;
  }  
  logical_channel[num_logical_channels].spi_channel = spi_channel;    // 0: SW spi, 1: LCD SD card , 2+ system dependent
  logical_channel[num_logical_channels].sck = -1;
  logical_channel[num_logical_channels].mosi = -1;
  logical_channel[num_logical_channels].miso = -1;
  logical_channel[num_logical_channels].chip_select = cs_pin;          // -1 - not used
  logical_channel[num_logical_channels].chip_select_polarity = cs_polarity;  // 0 - active low
  logical_channel[num_logical_channels].frequency = frequency;
  logical_channel[num_logical_channels].spi_mode = spi_mode;
  logical_channel[num_logical_channels].bit_order = 1;
  logical_channel[num_logical_channels].busy = false;
  logical_channel[num_logical_channels].num_bits = 8;
  get_frequency_used(num_logical_channels);  // get settings for CR0 & CPSR
  return num_logical_channels;
}

int8_t create_logical_spi_channel(pin_t sck, pin_t mosi, pin_t miso, pin_t cs, bool cs_polarity, uint32_t frequency, uint8_t spi_mode) {
  // make sure software SPI doesn't try to use any of the hardware SPI pins
  if (sck == P0_15 || sck == P0_07 ||
     mosi == P0_18 || mosi == P0_09 ||
     miso == P0_17 || miso == P0_08)
    return -1;
  num_logical_channels++;
  if (num_logical_channels == NUM_SPI_CHANNELS) {  // warn if out of channels
    SPI_warning_delay = millis() + 10000;
    out_of_channels = true;
    return -1;
  }
  logical_channel[num_logical_channels].spi_channel = 0;    // 0: SW spi, 1: LCD SD card , 2+ system dependent
  logical_channel[num_logical_channels].sck = sck;
  logical_channel[num_logical_channels].mosi = mosi;
  logical_channel[num_logical_channels].miso = miso;
  logical_channel[num_logical_channels].chip_select = cs;          // -1 - not used
  logical_channel[num_logical_channels].chip_select_polarity = cs_polarity;  // 0 - active low
  logical_channel[num_logical_channels].frequency = frequency;
  logical_channel[num_logical_channels].spi_mode = spi_mode;
  logical_channel[num_logical_channels].bit_order = 1;
  logical_channel[num_logical_channels].busy = false;
  logical_channel[num_logical_channels].num_bits = 8;
  logical_channel[num_logical_channels].sck_bit_mask = _BV(LPC1768_PIN_PIN(sck));
  logical_channel[num_logical_channels].mosi_set_reg = &LPC_GPIO(LPC1768_PIN_PORT(miso))->FIOSET;
  logical_channel[num_logical_channels].mosi_clr_reg = &LPC_GPIO(LPC1768_PIN_PORT(miso))->FIOCLR;
  logical_channel[num_logical_channels].mosi_bit_mask = _BV(LPC1768_PIN_PIN(mosi));
  logical_channel[num_logical_channels].miso_read_reg = &LPC_GPIO(LPC1768_PIN_PORT(miso))->FIOPIN;
  logical_channel[num_logical_channels].miso_bit_mask = _BV(LPC1768_PIN_PIN(miso));
  if (spi_mode & 0x02) {                  // CPOL = 1 (SCK idle high)
    logical_channel[num_logical_channels].clock_active_register = &LPC_GPIO(LPC1768_PIN_PORT(sck))->FIOCLR;
    logical_channel[num_logical_channels].clock_inactive_register = &LPC_GPIO(LPC1768_PIN_PORT(sck))->FIOSET;
  }
  else {
    logical_channel[num_logical_channels].clock_active_register = &LPC_GPIO(LPC1768_PIN_PORT(sck))->FIOSET;
    logical_channel[num_logical_channels].clock_inactive_register = &LPC_GPIO(LPC1768_PIN_PORT(sck))->FIOCLR;
  }
  get_frequency_used(num_logical_channels);
  return num_logical_channels;
}

void set_frequency(int8_t channel, uint32_t frequency) {
  logical_channel[channel].frequency = frequency;
  get_frequency_used(channel);
  setup_hardware_channel(channel);  // change to new frequency
}

void HAL_SW_SPI_transfer(uint8_t channel, const uint8_t *buffer_write, uint8_t *buffer_read, uint32_t length);
bool begin_transmision(int8_t channel);


void HAL_SPI_transfer(uint8_t channel, const uint8_t *buffer_write, uint8_t *buffer_read, uint32_t length) {
  if (out_of_channels && first_time_warning && millis() > SPI_warning_delay) {  // warn if out of SPI channels
    first_time_warning = false;
    MYSERIAL.printf("out of SPI channels\n");
  }  
  if (channel != active_logical_channel)
    begin_transmision(channel);  // someone else wants to talk
  if (logical_channel[channel].spi_channel) {  // hardware spi

