Bob-the-Kuhn/Marlin/Marlin/src/HAL/HAL_LPC1768/SPI_manager_LPC1768.cpp
    hardware_channel[logical_channel[channel].spi_channel].xfer_config.tx_data = (void *)buffer_write;
    hardware_channel[logical_channel[channel].spi_channel].xfer_config.rx_data = (void *)buffer_read;
    hardware_channel[logical_channel[channel].spi_channel].xfer_config.length = length;

    (void)SSP_ReadWrite(hardware_channel[logical_channel[channel].spi_channel].peripheral, &hardware_channel[logical_channel[channel].spi_channel].xfer_config, SSP_TRANSFER_POLLING); //SSP_TRANSFER_INTERRUPT
  }
  else
    HAL_SW_SPI_transfer(channel, buffer_write, buffer_read, length);
}


bool end_transmision(int8_t channel) {
  if (active_logical_channel != channel)
    return false; // trying to shut down the wrong channel
  active_logical_channel = -1;
  active_hardware_channel = -1;
  logical_channel[channel].busy = false;
  hardware_channel[logical_channel[channel].spi_channel].in_use = false;
  chip_select_inactive(channel);
  return true;
}


bool begin_transmision(int8_t channel) {
  if (active_logical_channel >= 0) {
    logical_channel[active_logical_channel].busy = false;
    hardware_channel[logical_channel[active_logical_channel].spi_channel].in_use = false;
  }
  active_logical_channel = channel;
  active_hardware_channel = logical_channel[channel].spi_channel;
  logical_channel[channel].busy = true;
  hardware_channel[logical_channel[channel].spi_channel].in_use = true;

  initialise_pins(channel);
  setup_hardware_channel(channel);
  chip_select_active(channel);
  return true;
}


void read(uint8_t channel, uint8_t *buffer, uint32_t length) {
  HAL_SPI_transfer(channel, nullptr, buffer, length);
}

uint8_t read(uint8_t channel) {
  uint8_t buffer;
  HAL_SPI_transfer(channel, nullptr, &buffer, 1);
  return buffer;
}

void write(uint8_t channel, const uint8_t *buffer, uint32_t length) {
  HAL_SPI_transfer(channel, buffer, nullptr, length);
}

void write(uint8_t channel, uint8_t value) {
  HAL_SPI_transfer(channel, &value, nullptr, 1);
}

void transfer(uint8_t channel, const uint8_t *buffer_write, uint8_t *buffer_read, uint32_t length) {
  HAL_SPI_transfer(channel, buffer_write,  buffer_read, length);
}

uint8_t transfer(uint8_t channel, uint8_t value) {
  uint8_t buffer;
  HAL_SPI_transfer(channel, &value, &buffer, 1);
  return buffer;
}

/*
 *  Interrupt Handlers
 */
extern "C" void ssp_irq_handler(uint8_t hw_channel) {

  SSP_DATA_SETUP_Type *xf_setup;
  uint32_t tmp;
  uint8_t dataword;

  // Disable all SSP interrupts
  SSP_IntConfig(hardware_channel[hw_channel].peripheral, SSP_INTCFG_ROR | SSP_INTCFG_RT | SSP_INTCFG_RX | SSP_INTCFG_TX, DISABLE);

  dataword = (SSP_GetDataSize(hardware_channel[hw_channel].peripheral) > 8) ? 1 : 0;

  xf_setup = &hardware_channel[hw_channel].xfer_config;
  // save status
  tmp = SSP_GetRawIntStatusReg(hardware_channel[hw_channel].peripheral);
  xf_setup->status = tmp;

  // Check overrun error
  if (tmp & SSP_RIS_ROR) {
    // Clear interrupt
    SSP_ClearIntPending(hardware_channel[hw_channel].peripheral, SSP_INTCLR_ROR);
    // update status
    xf_setup->status |= SSP_STAT_ERROR;
    // Set Complete Flag
    hardware_channel[hw_channel].xfer_complete = SET;
    return;
  }

  if ((xf_setup->tx_cnt != xf_setup->length) || (xf_setup->rx_cnt != xf_setup->length)) {
    /* check if RX FIFO contains data */
    while ((SSP_GetStatus(hardware_channel[hw_channel].peripheral, SSP_STAT_RXFIFO_NOTEMPTY)) && (xf_setup->rx_cnt != xf_setup->length)) {
      // Read data from SSP data
      tmp = SSP_ReceiveData(hardware_channel[hw_channel].peripheral);

      // Store data to destination
      if (xf_setup->rx_data != nullptr) {
        if (dataword == 0) {
          *(uint8_t *) ((uint32_t) xf_setup->rx_data + xf_setup->rx_cnt) = (uint8_t) tmp;
        } else {
          *(uint16_t *) ((uint32_t) xf_setup->rx_data + xf_setup->rx_cnt) = (uint16_t) tmp;
        }
      }
      // Increase counter
      if (dataword == 0) {
        xf_setup->rx_cnt++;
      } else {
        xf_setup->rx_cnt += 2;
      }
    }

    while ((SSP_GetStatus(hardware_channel[hw_channel].peripheral, SSP_STAT_TXFIFO_NOTFULL)) && (xf_setup->tx_cnt != xf_setup->length)) {
      // Write data to buffer
      if (xf_setup->tx_data == nullptr) {
        if (dataword == 0) {
          SSP_SendData(hardware_channel[hw_channel].peripheral, 0xFF);
          xf_setup->tx_cnt++;
        } else {
          SSP_SendData(hardware_channel[hw_channel].peripheral, 0xFFFF);
          xf_setup->tx_cnt += 2;
        }
      } else {
        if (dataword == 0) {
          SSP_SendData(hardware_channel[hw_channel].peripheral, (*(uint8_t *) ((uint32_t) xf_setup->tx_data + xf_setup->tx_cnt)));
          xf_setup->tx_cnt++;
        } else {
          SSP_SendData(hardware_channel[hw_channel].peripheral, (*(uint16_t *) ((uint32_t) xf_setup->tx_data + xf_setup->tx_cnt)));
          xf_setup->tx_cnt += 2;
        }
      }

      // Check overrun error
      if (SSP_GetRawIntStatus(hardware_channel[hw_channel].peripheral, SSP_INTSTAT_RAW_ROR)) {
        // update status
        xf_setup->status |= SSP_STAT_ERROR;
        // Set Complete Flag
        hardware_channel[hw_channel].xfer_complete = SET;
        return;
      }

      // Check for any data available in RX FIFO
      while ((SSP_GetStatus(hardware_channel[hw_channel].peripheral, SSP_STAT_RXFIFO_NOTEMPTY)) && (xf_setup->rx_cnt != xf_setup->length)) {
        // Read data from SSP data
        tmp = SSP_ReceiveData(hardware_channel[hw_channel].peripheral);

        // Store data to destination
        if (xf_setup->rx_data != nullptr) {
          if (dataword == 0) {
            *(uint8_t *) ((uint32_t) xf_setup->rx_data + xf_setup->rx_cnt) = (uint8_t) tmp;
          } else {
            *(uint16_t *) ((uint32_t) xf_setup->rx_data + xf_setup->rx_cnt) = (uint16_t) tmp;
          }
        }
        // Increase counter
        if (dataword == 0) {
          xf_setup->rx_cnt++;
        } else {
          xf_setup->rx_cnt += 2;
        }
      }
    }
  }

  // If there more data to sent or receive
  if ((xf_setup->rx_cnt != xf_setup->length) || (xf_setup->tx_cnt != xf_setup->length)) {
    // Enable all interrupt
    SSP_IntConfig(hardware_channel[hw_channel].peripheral, SSP_INTCFG_ROR | SSP_INTCFG_RT | SSP_INTCFG_RX | SSP_INTCFG_TX, ENABLE);
  } else {
    // Save status
    xf_setup->status = SSP_STAT_DONE;
    // Set Complete Flag
    hardware_channel[hw_channel].xfer_complete = SET;
  }
} //ssp_irq_handler



/////////////////   software SPI  //////////////////////////////

