Bob-the-Kuhn/Marlin/Marlin/src/HAL/HAL_LPC1768/SPI_manager_LPC1768.cpp
#define nop() __asm__ __volatile__("nop;\n\t":::)

void __delay_4cycles(uint32_t cy) __attribute__ ((weak));

FORCE_INLINE void __delay_4cycles(uint32_t cy) { // +1 cycle
  #if ARCH_PIPELINE_RELOAD_CYCLES<2
    #define EXTRA_NOP_CYCLES "nop"
  #else
    #define EXTRA_NOP_CYCLES ""
  #endif

  __asm__ __volatile__(
    ".syntax unified" "\n\t" // is to prevent CM0,CM1 non-unified syntax

    "loop%=:" "\n\t"
    " subs %[cnt],#1" "\n\t"
    EXTRA_NOP_CYCLES "\n\t"
    " bne loop%=" "\n\t"
    : [cnt]"+r"(cy) // output: +r means input+output
    : // input:
    : "cc" // clobbers:
  );
}

uint8_t sw_SPI_send(uint8_t channel, uint8_t data) {
  uint16_t i, data_return;

  uint8_t delay_A = logical_channel[channel].delay_A;
  uint8_t delay_B = logical_channel[channel].delay_B;

  #define READ_MISO(channel) ((*logical_channel[channel].miso_read_reg & logical_channel[channel].miso_bit_mask) ? 1 : 0)
  uint16_t bit_test;

  bit_test = _BV(logical_channel[channel].num_bits -1);
  if (logical_channel[channel].spi_mode & 0x01) { // CPHA 1 - data changes on leading edge (slave clocks in data on trailing edge)
    data_return = 0;
    for (i = 0; i < logical_channel[channel].num_bits; i ++) {

      __delay_4cycles(delay_A);

      *logical_channel[channel].clock_active_register = logical_channel[channel].sck_bit_mask;

      if (data & bit_test)
        *logical_channel[channel].mosi_set_reg = logical_channel[channel].mosi_bit_mask;
      else
        *logical_channel[channel].mosi_clr_reg = logical_channel[channel].mosi_bit_mask;

      data_return <<= 1;
      data <<= 1;
      __delay_4cycles(delay_B);
      data_return |= READ_MISO(channel);
      *logical_channel[channel].clock_inactive_register = logical_channel[channel].sck_bit_mask;

    }
    return data_return;
  }
  else {
    data_return = 0;

    // for CPHA = 0 the data must be present long before the first clock edge
    // yes, we are sending 9 bits but the last one is always zero which is what is wanted

    if (data & bit_test)
      *logical_channel[channel].mosi_set_reg = logical_channel[channel].mosi_bit_mask;
    else
      *logical_channel[channel].mosi_clr_reg = logical_channel[channel].mosi_bit_mask;

    for (i = 0; i < logical_channel[channel].num_bits; i ++) {

      data_return <<= 1;

      __delay_4cycles(delay_A);

      *logical_channel[channel].clock_active_register = logical_channel[channel].sck_bit_mask;

      data_return |= READ_MISO(channel);

      data <<= 1;

      __delay_4cycles(delay_B);

      if (data & bit_test)
        *logical_channel[channel].mosi_set_reg = logical_channel[channel].mosi_bit_mask;
      else
        *logical_channel[channel].mosi_clr_reg = logical_channel[channel].mosi_bit_mask;

      *logical_channel[channel].clock_inactive_register = logical_channel[channel].sck_bit_mask;

    }
    return data_return;
  }
} // sw_SPI_send


void HAL_SW_SPI_transfer(uint8_t channel, const uint8_t *buffer_write, uint8_t *buffer_read, uint32_t length) {
  if (buffer_write == nullptr) {
    for (uint32_t i = 0; i < length; i++) { buffer_read[i] = sw_SPI_send(channel, 0xFF);}
  }
  else {
    if (buffer_read == nullptr) {
      for (uint32_t i = 0; i < length; i++) {sw_SPI_send(channel, buffer_write[i]);}
    }
    else
      for (uint32_t i = 0; i < length; i++) {buffer_read[i] = sw_SPI_send(channel, buffer_write[i]);}
  }

} // HAL_SW_SPI_transfer

}  // SPI
}  // HAL

extern "C" void SSP0_IRQHandler(void) {
  HAL::SPI::ssp_irq_handler(1);
}

extern "C" void SSP1_IRQHandler(void) {
  HAL::SPI::ssp_irq_handler(2);
}

#endif // TARGET LPC1768
